Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: **Container engine:** Podman (if not on Windows, `Download Podman <https://github.com/containers/podman/releases>`_)
it_it: **Container engine:** Podman (se non su Windows, `Scaricare Podman <https://github.com/containers/podman/releases>`_)

source: **Containers**: MP4, WebM, AVI, MKV, MOV, FLV, and more
it_it: **Contenitori**: MP4, WebM, AVI, MKV, MOV, FLV e altri

source: **Cross-Compilation**: The SDK allows developers to cross-compile applications from a host machine (typically x86 or x86_64 architecture) for a different architecture (e.g., ARM).
it_it: **Cross-Compilazione**: L'SDK consente agli sviluppatori di compilare in modo incrociato le applicazioni da una macchina host (tipicamente con architettura x86 o x86_64) per un'architettura diversa (ad esempio, ARM).

source: **Cross-platform** the same XML works across all LVGL targets
it_it: **Multipiattaforma** lo stesso XML funziona su tutti i target LVGL

source: **Customizable** - Out-of-the-box support for 500+ boards and high portability.
it_it: **Personalizzabile** - Supporto immediato per oltre 500 schede e elevata portabilità.

source: **DEPRECATED**, set the width to ``LV_SIZE_CONTENT`` or fixed value to control expanding/wrapping.
it_it: **DEPRECATO**, impostare la larghezza a ``LV_SIZE_CONTENT`` o su un valore fisso per controllare l'espansione/wrapping.

source: **DRM + EGL Driver**.
it_it: **Driver DRM + EGL**.

source: **Data Binding** See the power of data bindings.
it_it: **Data Binding** La potenza dei data binding.

source: **Dave2D Renderer improvements.** Lower CPU usage on Renesas and Alif platforms with optimized Dave2D integration.
it_it: **Miglioramenti del Renderer Dave2D.** Minor utilizzo della CPU sulle piattaforme Renesas e Alif con integrazione ottimizzata di Dave2D.

source: **Decide what storage system you want to use**
it_it: **Decidere quale sistema di archiviazione utilizzare**

source: **Decoupling** - Leverages devicetree to describe and configure the target system.
it_it: **Disaccoppiamento** - Sfrutta il devicetree per descrivere e configurare il sistema target.

source: **Destructor hook**: Called when the Widget is deleted.
it_it: **Hook del distruttore**: Viene richiamato quando il Widget viene eliminato.

source: **Develop Features**: Help to design or develop a feature.
it_it: **Sviluppo di Funzionalità**: Aiutare a progettare o sviluppare una funzionalità.

source: **Development Environment**: The SDK provides developers with a ready-to-use development environment tailored for a specific target hardware platform.
it_it: **Ambiente di sviluppo**: L'SDK fornisce agli sviluppatori un ambiente di sviluppo pronto all'uso, personalizzato per una specifica piattaforma hardware di destinazione.

source: **Draw Descriptor**: This is a large ``struct`` containing all the information about the drawing.
it_it: **Draw Descriptor**: Questa è una ``struct`` di grandi dimensioni contenente tutte le informazioni sul disegno.

source: **Draw to the Canvas Widget**: The canvas itself doesn't store a layer, but one can be easily created and used like this:
it_it: **Disegnare sul Widget Canvas**: Il canvas in sé non memorizza un layer, ma è possibile crearne e utilizzarne uno facilmente in questo modo:

source: **Draw to the Canvas Widget**: The drawing functions can be used directly to draw to a Canvas Widget.
it_it: **Disegna sul Widget Canvas**: Le funzioni di disegno possono essere utilizzate direttamente per disegnare su un Widget Canvas.

source: **ESP PPA Hardware Accelerator**.
it_it: **Acceleratore hardware ESP PPA**.

source: **EVE GPU Renderer Support**.
it_it: **Supporto per il rendering GPU EVE**.

source: **EXTENDPE**: The epoch — if PE is not specified, which is usually the case for most recipes, then EXTENDPE is blank.
it_it: **EXTENDPE**: Epoch: se PE non è specificato, come solitamente accade per la maggior parte delle ricette, EXTENDPE è vuoto.

source: **EXTRA_OECMAKE**: Additional options passed to CMake during the configuration step.
it_it: **EXTRA_OECMAKE**: Opzioni aggiuntive passate a CMake durante la fase di configurazione.

source: **Easy to share** copy, paste, and send as text
it_it: **Facile da condividere** copiare, incollare e inviare come testo

source: **Ecosystem** - Zephyr not only provides the RTOS kernel but also developer tooling, device drivers, connectivity, logging, tracing, power management and much more.
it_it: **Ecosistema** - Zephyr non fornisce solo il kernel RTOS, ma anche strumenti di sviluppo, device driver, connettività, logging, tracing, gestione dell'alimentazione e molto altro.

source: **Enable GStreamer Support**
it_it: **Abilitare il Supporto GStreamer**

source: **Event hook**: Called at the beginning of the Widget's event callback to perform any custom action.
it_it: **Hook dell'evento**: Viene richiamato all'inizio della callback dell'evento del Widget per eseguire qualsiasi azione personalizzata.

source: **Example:**
it_it: **Esempio:**

source: **Example:** "%d |deg|\ C"
it_it: **Esempio:** "%d |deg|\ C"

source: **Examples for Unix-like file systems:**
it_it: **Esempi per file system di tipo Unix:**

source: **Examples for Windows/DOS-like file systems:**
it_it: **Esempi per file system di tipo Windows/DOS:**

source: **Exceptions to the Above:**
it_it: **Eccezioni a quanto Sopra:**

source: **FFmpeg** is a complete, cross-platform solution to record, convert and stream audio and video.
it_it: **FFmpeg** è una soluzione completa e multipiattaforma per registrare, convertire e trasmettere in streaming audio e video.

source: **FILES**: This is a BitBake variable used to specify the files that should be included in a particular package.
it_it: **FILES**: Questa è una variabile BitBake utilizzata per specificare i file che devono essere inclusi in un particolare pacchetto.

source: **Familiar syntax** works like HTML, easy to learn and read
it_it: **Sintassi familiare** funziona come HTML, facile da imparare e leggere

source: **Fast to edit** quicker to type than to drag and drop with a mouse
it_it: **Veloce da modificare** più veloce da digitare rispetto al trascinamento della selezione con il mouse

source: **Faster GIF Library**.
it_it: **Libreria GIF Velocizzata**.

source: **Features:**
it_it: **Funzionalità:**

source: **Figma Plugin** that allows you to extract the style properties from Figma elements and also synchronize them in the Editor or with the CLI.
it_it: **Plugin Figma** che consente di estrarre le proprietà di stile dagli elementi Figma e di sincronizzarle nell'Editor o con la CLI.

source: **Find a descendant at any level** using :cpp:expr:`lv_obj_find_by_name(parent, "child_name")`.
it_it: *Trovare un discendente a qualsiasi livello** utilizzando :cpp:expr:`lv_obj_find_by_name(parent, "child_name")`.

source: **FreeType** is a freely available software library to render fonts.
it_it: **FreeType** è una libreria software gratuita per il rendering di font.

source: **From LVGL v8.1 onward, the header is added directly into the Calendar Widget and the API of the headers has been changed.**
it_it: **Da LVGL v8.1 in poi, l'intestazione viene aggiunta direttamente al widget Calendar e l'API delle intestazioni è stata modificata.**

source: **GIF Decoder** is an LVGL extension that enables you to use GIF images in your LVGL UI.
it_it: **GIF Decoder** è un'estensione LVGL che consente di utilizzare immagini GIF nell'interfaccia utente LVGL.

source: **GStreamer Support**.
it_it: **Supporto GStreamer**.

source: **GStreamer** is a pipeline-based multimedia framework that links together a wide variety of media processing systems to complete complex workflows.
it_it: **GStreamer** è un framework multimediale basato su pipeline che collega un'ampia gamma di sistemi di elaborazione multimediale per completare flussi di lavoro complessi.

source: **Geometry**: Meshes, primitives, and vertex data
it_it: **Geometria**: Mesh, primitive e dati sui vertici

source: **Get a direct child by name** using :cpp:expr:`lv_obj_get_child_by_name(parent, "child_name")`.
it_it: *Ottenere un figlio diretto per nome** utilizzando :cpp:expr:`lv_obj_get_child_by_name(parent, "child_name")`.

source: **Hello World** See how to create a styled button with a label in XML.
it_it: **Hello World** Come creare un pulsante con stile e un'etichetta in XML.

source: **How it Works:**
it_it: **Come Funziona:**

source: **IMPORTANT**: The transformation of the image is independent of the transformation properties :ref:`coming from styles <style_opacity_blend_modes_transformations>`.
it_it: **IMPORTANTE**: La trasformazione dell'immagine è indipendente dalle proprietà di trasformazione :ref:`derivate dagli stili <style_opacity_blend_modes_transformations>`.

source: **Important note:** Zephyr automatically defines the ``LV_CONF_INCLUDE_SIMPLE`` symbol during the LVGL module build process, so it is not necessary to define it manually in your CMakeLists.txt.
it_it: **Nota importante:** Zephyr definisce automaticamente il simbolo ``LV_CONF_INCLUDE_SIMPLE`` durante il processo di compilazione del modulo LVGL, quindi non è necessario definirlo manualmente in CMakeLists.txt.

source: **Important**
it_it: **Importante**

source: **In draw events**: In ``LV_EVENT_DRAW_MAIN/POST_BEGIN/...`` events the Widget is being rendered to a layer of the display or another temporary layer created earlier during rendering.
it_it: **Negli eventi di disegno**: Negli eventi ``LV_EVENT_DRAW_MAIN/POST_BEGIN/...``, il widget viene renderizzato su un layer del display o su un altro layer temporaneo creato in precedenza durante il rendering.

source: **In the draw events of the Widgets**: There are event codes which are sent when the Widget needs to render itself:
it_it: **Negli eventi di disegno dei Widget**: Ci sono codici evento che vengono inviati quando il Widget deve eseguire il rendering:

source: **Indexed transparent color**: a specific index in a color palette serves to signal transparency for each pixel that uses it.
it_it: **Colore trasparente indicizzato**: un indice specifico in una tavolozza di colori serve a segnalare la trasparenza per ogni pixel che lo utilizza.

source: **Indexed**: Image has a color palette, and each pixel is an index into that palette.
it_it: **Indicizzato**: L'immagine ha una tavolozza colori e ogni pixel è un indice di tale tavolozza.

source: **Install Dependencies**
it_it: **Installazione delle Dipendenze**

source: **Invoke proper API calls in the application code**
it_it: **Invocare le chiamate API appropriate nel codice dell'applicazione**

source: **Join Our** `Forum <https://forum.lvgl.io/>`__ : Meet fellow developers and discuss questions.
it_it: **Unirsi al Nostro** `Forum <https://forum.lvgl.io/>`__ : Per incontrare altri sviluppatori e porre le proprie domande.

source: **LICENSE**: Indicates the licensing of the software, stating that it is distributed under the MIT License.
it_it: **LICENSE**: Indica la licenza del software, indicando che è distribuito con licenza MIT.

source: **LIC_FILES_CHKSUM**: This variable contains a checksum (in this case, an MD5 hash) for the license file (here assumed to be LICENCE.txt).
it_it: **LIC_FILES_CHKSUM**: Questa variabile contiene un checksum (in questo caso, un hash MD5) per il file di licenza (qui si presume sia LICENCE.txt).

source: **LV_USE_NUTTX_INDEPENDENT_IMAGE_HEAP** - You can enable or disable the LVGL image heap in NuttX.
it_it: **LV_USE_NUTTX_INDEPENDENT_IMAGE_HEAP** - È possibile abilitare o disabilitare l'heap delle immagini LVGL in NuttX.

source: **Layer**: This is the target of the drawing.
it_it: **Layer**: Questo è il target del disegno.

source: **Layouts** Check out the nested flex layouts in action.
it_it: **Layouts** I layout flex annidati in azione.

source: **Limitations:**
it_it: **Limitazioni:**

source: **Local files**: ``file://path/to/video.mp4``
it_it: **File locali**: ``file://path/to/video.mp4``

source: **LodePNG** is an LVGL interface to the LodePNG library --- a PNG encoder and decoder in C and C++, without any dependencies, giving you an alternate way to use PNG images in your LVGL UI.
it_it: **LodePNG** è un'interfaccia LVGL per la libreria LodePNG, un codificatore e decoder PNG in C e C++, senza dipendenze, che offre un modo alternativo per utilizzare le immagini PNG nell'interfaccia utente LVGL.

source: **MULTIMACH_TARGET_SYS**: The target system identifier
it_it: **MULTIMACH_TARGET_SYS**: Identificativo del sistema target

source: **Manual Compilation with pkg-config**
it_it: **Compilazione Manuale con pkg-config**

source: **Materials**: PBR (Physically Based Rendering) materials with textures
it_it: **Materiali**: Materiali PBR (Physically Based Rendering) con texture

source: **Media Format Support:**
it_it: **Supporto Formati Multimediali:**

source: **Media Source Support:**
it_it: **Supporto per Sorgenti Multimediali:**

source: **Modify conf file (Option 2)**
it_it: **Modifica del file di configurazione (Opzione 2)**

source: **Modifying the created Draw Tasks**: In :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED` the draw tasks created by ``lv_draw_rect/label/etc`` can be modified.
it_it: **Modifica dei Task di Disegno creati**: In :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED` i task di disegno creati da ``lv_draw_rect/label/etc`` possono essere modificati.

source: **Modifying the created draw tasks**: The when a draw task is created for a Widget :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED` is sent.
it_it: **Modifica dei task di disegno creati**: Quando viene creato un task di disegno per un Widget, viene inviato :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`.

source: **Modular by design** create reusable components for structured UIs
it_it: **Nattivamente modulare** creare componenti riutilizzabili per interfacce utente strutturate

source: **Modular** - Its modular design allows developers to select only what really matters and use modules to include new features.
it_it: **Modulare** - Il suo design modulare consente agli sviluppatori di selezionare solo ciò che conta davvero e di utilizzare i moduli per includere nuove funzionalità.

source: **New Component** Create new components and build a screen from them.
it_it: **New Component** Crea nuovi componenti e una schermata a partire da essi.

source: **Not supported yet; the examples below illustrate the planned syntax.**
it_it: **Non ancora supportato; gli esempi seguenti illustrano la sintassi pianificata.**

source: **Note that this method is an alternative to including LVGL in your project.
it_it: **Notare che questo metodo è un'alternativa all'inclusione di LVGL nel progetto.

source: **Online Share** is an online version of the Editor which can load the XML files from a GitHub repository to easily share the developed UIs without setting up any development environments.
it_it: **Online Share** è una versione online dell'Editor che può caricare i file XML da un repository GitHub per condividere facilmente le interfacce utente sviluppate senza dover configurare alcun ambiente di sviluppo.

source: **Option 1: Direct linking with LVGL (Recommended)**
it_it: **Opzione 1: Link diretto con LVGL (Consigliato)**

source: **Option 1: Multiple calls (Recommended)**
it_it: **Opzione 1: Chiamate multiple (Consigliata)**

source: **Option 2: Single call with bitwise OR**
it_it: **Opzione 2: Chiamata singola con OR bit a bit**

source: **PN**: The recipe name
it_it: **PN**: Nome della ricetta

source: **PR**: The recipe revision
it_it: **PR**: Revisione della ricetta

source: **PV**: The recipe version
it_it: **PV**: Versione della ricetta

source: **Platform:** Node 18+ recommended
it_it: **Piattaforma:** Node 18+ consigliato

source: **Playback Control:**
it_it: **Controllo della Riproduzione:**

source: **Popular** - NuttX is used by many companies around the world.
it_it: **Popolare** - NuttX è utilizzato da molte aziende in tutto il mondo.

source: **Predictable** - NuttX is a preemptible Realtime kernel, so you can use it to create predictable applications for realtime control.
it_it: **Prevedibile** - NuttX è un kernel "Realtime preemptible", quindi lo si può usare per creare applicazioni prevedibili per il controllo in tempo reale.

source: **Prepare the image files**
it_it: **Preparare i file delle immagini**

source: **RTSP streams**: ``rtsp://camera.local/stream``
it_it: **Flussi RTSP**: ``rtsp://camera.local/stream``

source: **Radius of Rectangles**: Set the `radius` style property or the ``radius`` in the draw descriptors.
it_it: **Raggio dei rettangoli**: Imposta la proprietà di stile `radius` o il ``radius`` nei descrittori di disegno.

source: **Re-configure your own project**
it_it: **Riconfigurare il progetto**

source: **Realistic reflections** on shiny surfaces that mirror the environment
it_it: **Riflessi realistici** su superfici lucide che riflettono l'ambiente

source: **Reason:**
it_it: **Motivo:**

source: **Rectangle Mask Draw Task**: A special Draw Task can mask out a rectangle from a layer by setting the alpha channel of certain pixels to 0.
it_it: **Task di Disegno con Maschera Rettangolare**: Un Task di disegno speciale può mascherare un rettangolo da un layer impostando il canale alfa di determinati pixel a 0.

source: **Register custom widgets**.
it_it: **Registrare i widget personalizzati**.

source: **Report a Bug**: Open a `GitHub Issue <https://github.com/lvgl/lvgl/issues>`__ if something is not working.
it_it: *Segnalare un Bug**: Aprire un `GitHub Issue <https://github.com/lvgl/lvgl/issues>`__ se qualcosa non funziona.

source: **Requirements:**
it_it: **Requisiti:**

source: **Reusable patterns** copy and reuse snippets across projects
it_it: **Pattern riutilizzabili** copiare e riutilizzare frammenti tra progetti

source: **Runtime loading** parse XML at runtime without recompiling
it_it: **Caricamento a runtime** elaborare l'XML in fase di esecuzione senza ricompilazione

source: **S**: This variable defines the source directory where the unpacked source code will be located after fetching.
it_it: **S**: Questa variabile definisce la directory sorgente in cui verrà posizionato il codice sorgente decompresso dopo il recupero.

source: **SRCREV**: Defines the specific commit (in this case, a Git SHA hash) from which the source code will be fetched.
it_it: **SRCREV**: Definisce il commit specifico (in questo caso, un hash Git SHA) da cui verrà recuperato il codice sorgente.

source: **SRC_URI**: Specifies the locations of the source code and patches for the recipe:
it_it: **SRC_URI**: Specifica le posizioni del codice sorgente e delle patch per la ricetta:

source: **Scalable** - Usable for complex multicore systems.
it_it: **Scalabile** - Utilizzabile per sistemi multicore complessi.

source: **Scenes**: Hierarchical scene graphs with node transformations
it_it: **Scene**: Grafi gerarchici di scene con trasformazioni dei nodi

source: **Screens** Try out the screen load and screen create events.
it_it: **Screens** Prova gli eventi di caricamento e creazione delle schermate.

source: **Secure** - Built with safety and security in mind, offers Long-term support.
it_it: **Sicuro** - Progettato pensando alla sicurezza e alla protezione, offre supporto "Long-term" [a lungo termine].

source: **Simple Layers**: Simple layers can be rendered in chunks.
it_it: **Layer semplici**: I layer semplici possono essere renderizzati in blocchi.

source: **Simplified Development**: By packaging all required components, the SDK simplifies the process of setting up a development environment.
it_it: **Sviluppo Semplificato**: Impacchettando tutti i componenti necessari, l'SDK semplifica il processo di configurazione di un ambiente di sviluppo.

source: **Small** - Fits and runs in microcontrollers as small as 32 kB Flash and 8 kB of RAM.
it_it: **Piccolo** - Si adatta e funziona su microcontrollori con soli 32 kB di Flash e 8 kB di RAM.

source: **Small** - Runs on microcontrollers as small as 8 kB Flash and 5 kB of RAM.
it_it: **Piccolo** - Funziona su microcontrollori con soli 8 kB di Flash e 5 kB di RAM.

source: **Spread the Word**: Share your LVGL experience with friends or on social media to boost its visibility.
it_it: **Spargere la voce**: Condividere la propria esperienza con LVGL con gli amici o sui social media per aumentarne la visibilità.

source: **Star LVGL** Give us a star on `GitHub <https://github.com/lvgl/lvgl>`__!
it_it: **Star LVGL** Dare una stella su `GitHub <https://github.com/lvgl/lvgl>`__!

source: **Subtle lighting effects** like under-lighting and color variation based on viewing angle
it_it: **Effetti di luce tenui** come illuminazione di fondo e variazione di colore in base all'angolo di visione

source: **TMPDIR**: The top-level build output directory
it_it: **TMPDIR**: Directory di output della build di livello superiore

source: **Tell Us Your Ideas**: If you feel something is missing from LVGL, we would love to hear about it in a `GitHub Issue <https://github.com/lvgl/lvgl/issues>`__
it_it: **Raccontare le proprie idee**: Se si ritiene che manchi qualcosa in LVGL, saremo lieti di riceverlo tramite un `GitHub Issue <https://github.com/lvgl/lvgl/issues>`__

source: **Test Steps**: Encapsulated in a ``<steps>`` tag, these define the actions and assertions for the test.
it_it: **Passi del Test**: Racchiusi nel tag ``<steps>``, definiscono le azioni e le asserzioni per il test.

source: **The last item** must be ``{null, null}``, or it will not work properly.
it_it: **L'ultimo elemento** deve essere ``{null, null}``, altrimenti non funzionerà correttamente.

source: **Tiny JPEG Decompressor** is an LVGL interface to the TJpgDec library --- a generic JPEG image decompressor module that highly optimized for small embedded systems.
it_it: **Tiny JPEG Decompressor** è un'interfaccia LVGL per la libreria TJpgDec, un modulo generico di decompressione di immagini JPEG altamente ottimizzato per piccoli sistemi embedded.

source: **Transform Layers**: Transformed Widgets cannot be rendered in chunks because transformations often affect pixels outside the given area.
it_it: **Layer di Trasformazione**: I Widget trasformati non possono essere renderizzati in blocchi perché le trasformazioni spesso interessano pixel esterni all'area specificata.

source: **Translations** Learn how to translate texts and preview them.
it_it: **Translations** Come tradurre i testi e visualizzarli in anteprima.

source: **UDP streams**: ``udp://239.255.12.42:1234``
it_it: **Flussi UDP**: ``udp://239.255.12.42:1234``

source: **UI Definition**: Use ``<styles>``, ``<consts>``, and ``<view>`` to define how the UI should look.
it_it: **Definizione dell'Interfaccia Utente**: Usa ``<styles>``, ``<consts>`` e ``<view>`` per definire l'aspetto dell'interfaccia utente.

source: **URI Factory (Recommended):**
it_it: **URI Factory (Consigliata):**

source: **URI Scheme Support:**
it_it: **Supporto per Schemi URI:**

source: **Usage:**
it_it: **Utilizzo:**

source: **V4L2 cameras**: ``v4l2:///dev/video0``
it_it: **Telecamere V4L2**: ``v4l2:///dev/video0``

source: **Vector based** vector, SVG; for the latter, the user provides the rendering logic.
it_it: vettore **Vector based**, SVG; per quest'ultimo, l'utente fornisce la logica di rendering.

source: **Versatile** - Supports many architectures (ARM, ARM Thumb, AVR, MIPS, OpenRISC, RISC-V 32-bit and 64-bit, RX65N, x86-64, Xtensa, Z80/Z180, etc.).
it_it: **Versatile** - Supporta numerose architetture (ARM, ARM Thumb, AVR, MIPS, OpenRISC, RISC-V a 32 e 64 bit, RX65N, x86-64, Xtensa, Z80/Z180, ecc.).

source: **Version 1.0 – June 2025**
it_it: **Versione 1.0 – Giugno 2025**

source: **Version control friendly** plain text with human-readable diffs, no binary files
it_it: **Controllo di versione intuitivo** testo semplice con differenze leggibili, senza file binari
